#![allow(non_snake_case)]
#![allow(non_camel_case_types)]
#![allow(non_upper_case_globals)]
#![allow(clippy::all)]
#![deny(clippy::cargo)]

/* automatically generated by rust-bindgen 0.58.1 */

pub const vlFalse: ::std::os::raw::c_uchar = 0;
pub const vlTrue: ::std::os::raw::c_uchar = 1;
pub const VTF_MAJOR_VERSION: u32 = 7;
pub const VTF_MINOR_VERSION: u32 = 5;
pub const VTF_MINOR_VERSION_DEFAULT: u32 = 3;
pub const VTF_MINOR_VERSION_MIN_SPHERE_MAP: u32 = 1;
pub const VTF_MINOR_VERSION_MIN_VOLUME: u32 = 2;
pub const VTF_MINOR_VERSION_MIN_RESOURCE: u32 = 3;
pub const VTF_MINOR_VERSION_MIN_NO_SPHERE_MAP: u32 = 5;
pub type vlBool = ::std::os::raw::c_uchar;
pub type vlChar = ::std::os::raw::c_char;
pub type vlByte = ::std::os::raw::c_uchar;
pub type vlShort = ::std::os::raw::c_short;
pub type vlUShort = ::std::os::raw::c_ushort;
pub type vlInt = ::std::os::raw::c_int;
pub type vlUInt = ::std::os::raw::c_uint;
pub type vlLong = ::std::os::raw::c_long;
pub type vlULong = ::std::os::raw::c_ulong;
pub type vlSingle = f32;
pub type vlDouble = f64;
pub type vlVoid = ::std::os::raw::c_void;
pub type vlFloat = vlSingle;
pub type vlOffset = vlLong;
pub type vlSSize = vlUInt;
pub type vlSize = vlUInt;
pub type vlUInt8 = ::std::os::raw::c_uchar;
pub type vlUInt16 = ::std::os::raw::c_ushort;
pub type vlUInt32 = ::std::os::raw::c_uint;
pub type vlUInt64 = ::std::os::raw::c_ulonglong;
pub const tagVLSeekMode_SEEK_MODE_BEGIN: tagVLSeekMode = 0;

pub use self::tagVTFResizeMethod as VTFResizeMethod;
pub const tagVTFLookDir_LOOK_DOWN_X: tagVTFLookDir = 0;
pub const tagVTFLookDir_LOOK_DOWN_NEGX: tagVTFLookDir = 1;
pub const tagVTFLookDir_LOOK_DOWN_Y: tagVTFLookDir = 2;
pub const tagVTFLookDir_LOOK_DOWN_NEGY: tagVTFLookDir = 3;
pub const tagVTFLookDir_LOOK_DOWN_Z: tagVTFLookDir = 4;
pub const tagVTFLookDir_LOOK_DOWN_NEGZ: tagVTFLookDir = 5;
#[doc = "! Spheremap creation look direction indices."]
pub type tagVTFLookDir = ::std::os::raw::c_int;
#[doc = "! Spheremap creation look direction indices."]
pub use self::tagVTFLookDir as VTFLookDir;
pub const tagVTFResourceEntryTypeFlag_RSRCF_HAS_NO_DATA_CHUNK: tagVTFResourceEntryTypeFlag = 2;
#[doc = "! Resource entry type flags."]
pub type tagVTFResourceEntryTypeFlag = ::std::os::raw::c_int;
#[doc = "! Resource entry type flags."]
pub use self::tagVTFResourceEntryTypeFlag as VTFResourceEntryTypeFlag;
pub const tagVTFResourceEntryType_VTF_LEGACY_RSRC_LOW_RES_IMAGE: tagVTFResourceEntryType = 1;
pub const tagVTFResourceEntryType_VTF_LEGACY_RSRC_IMAGE: tagVTFResourceEntryType = 48;
pub const tagVTFResourceEntryType_VTF_RSRC_SHEET: tagVTFResourceEntryType = 16;
pub const tagVTFResourceEntryType_VTF_RSRC_CRC: tagVTFResourceEntryType = 37966403;
pub const tagVTFResourceEntryType_VTF_RSRC_TEXTURE_LOD_SETTINGS: tagVTFResourceEntryType = 38031180;
pub const tagVTFResourceEntryType_VTF_RSRC_TEXTURE_SETTINGS_EX: tagVTFResourceEntryType = 38753108;
pub const tagVTFResourceEntryType_VTF_RSRC_KEY_VALUE_DATA: tagVTFResourceEntryType = 4478539;
pub const tagVTFResourceEntryType_VTF_RSRC_MAX_DICTIONARY_ENTRIES: tagVTFResourceEntryType = 32;
#[doc = "! Resource entry type idendifiers."]
pub type tagVTFResourceEntryType = ::std::os::raw::c_int;
#[doc = "! Resource entry type idendifiers."]
pub use self::tagVTFResourceEntryType as VTFResourceEntryType;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct tagSVTFImageFormatInfo {
    #[doc = "!< Enumeration text equivalent."]
    pub lpName: *const vlChar,
    #[doc = "!< Format bits per pixel."]
    pub uiBitsPerPixel: vlUInt,
    #[doc = "!< Format bytes per pixel."]
    pub uiBytesPerPixel: vlUInt,
    #[doc = "!< Format red bits per pixel.  0 for N/A."]
    pub uiRedBitsPerPixel: vlUInt,
    #[doc = "!< Format green bits per pixel.  0 for N/A."]
    pub uiGreenBitsPerPixel: vlUInt,
    #[doc = "!< Format blue bits per pixel.  0 for N/A."]
    pub uiBlueBitsPerPixel: vlUInt,
    #[doc = "!< Format alpha bits per pixel.  0 for N/A."]
    pub uiAlphaBitsPerPixel: vlUInt,
    #[doc = "!< Format is compressed (DXT)."]
    pub bIsCompressed: vlBool,
    #[doc = "!< Format is supported by VTFLib."]
    pub bIsSupported: vlBool,
}
#[test]
fn bindgen_test_layout_tagSVTFImageFormatInfo() {
    const UNINIT: ::std::mem::MaybeUninit<tagSVTFImageFormatInfo> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<tagSVTFImageFormatInfo>(),
        34usize,
        concat!("Size of: ", stringify!(tagSVTFImageFormatInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<tagSVTFImageFormatInfo>(),
        1usize,
        concat!("Alignment of ", stringify!(tagSVTFImageFormatInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lpName) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tagSVTFImageFormatInfo),
            "::",
            stringify!(lpName)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).uiBitsPerPixel) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tagSVTFImageFormatInfo),
            "::",
            stringify!(uiBitsPerPixel)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).uiBytesPerPixel) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(tagSVTFImageFormatInfo),
            "::",
            stringify!(uiBytesPerPixel)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).uiRedBitsPerPixel) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tagSVTFImageFormatInfo),
            "::",
            stringify!(uiRedBitsPerPixel)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).uiGreenBitsPerPixel) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(tagSVTFImageFormatInfo),
            "::",
            stringify!(uiGreenBitsPerPixel)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).uiBlueBitsPerPixel) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(tagSVTFImageFormatInfo),
            "::",
            stringify!(uiBlueBitsPerPixel)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).uiAlphaBitsPerPixel) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(tagSVTFImageFormatInfo),
            "::",
            stringify!(uiAlphaBitsPerPixel)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bIsCompressed) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(tagSVTFImageFormatInfo),
            "::",
            stringify!(bIsCompressed)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bIsSupported) as usize - ptr as usize },
        33usize,
        concat!(
            "Offset of field: ",
            stringify!(tagSVTFImageFormatInfo),
            "::",
            stringify!(bIsSupported)
        )
    );
}
pub type SVTFImageFormatInfo = tagSVTFImageFormatInfo;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct tagSVTFCreateOptions {
    #[doc = "!< Output image version."]
    pub uiVersion: [vlUInt; 2usize],
    #[doc = "!< Output image output storage format."]
    pub ImageFormat: VTFImageFormat,
    #[doc = "!< Output image header flags."]
    pub uiFlags: vlUInt,
    #[doc = "!< Output image start frame."]
    pub uiStartFrame: vlUInt,
    #[doc = "!< Output image bump scale."]
    pub sBumpScale: vlSingle,
    #[doc = "!< Output image reflectivity. (Only used if bReflectivity is false.)"]
    pub sReflectivity: [vlSingle; 3usize],
    #[doc = "!< Generate MIPmaps. (Space is always allocated.)"]
    pub bMipmaps: vlBool,
    #[doc = "!< MIP map re-size filter."]
    pub MipmapFilter: VTFMipmapFilter,
    #[doc = "!< MIP map sharpen filter."]
    pub MipmapSharpenFilter: VTFSharpenFilter,
    #[doc = "!< Generate thumbnail image."]
    pub bThumbnail: vlBool,
    #[doc = "!< Compute image reflectivity."]
    pub bReflectivity: vlBool,
    #[doc = "!< Resize the input image."]
    pub bResize: vlBool,
    #[doc = "!< New size compution method."]
    pub ResizeMethod: VTFResizeMethod,
    #[doc = "!< Re-size filter."]
    pub ResizeFilter: VTFMipmapFilter,
    #[doc = "!< Sharpen filter."]
    pub ResizeSharpenFilter: VTFSharpenFilter,
    #[doc = "!< New width after re-size if method is RESIZE_SET."]
    pub uiResizeWidth: vlUInt,
    #[doc = "!< New height after re-size if method is RESIZE_SET."]
    pub uiResizeHeight: vlUInt,
    #[doc = "!< Clamp re-size size."]
    pub bResizeClamp: vlBool,
    #[doc = "!< Maximum width to re-size to."]
    pub uiResizeClampWidth: vlUInt,
    #[doc = "!< Maximum height to re-size to."]
    pub uiResizeClampHeight: vlUInt,
    #[doc = "!< Gamma correct input image."]
    pub bGammaCorrection: vlBool,
    #[doc = "!< Gamma correction to apply."]
    pub sGammaCorrection: vlSingle,
    #[doc = "!< Convert input image to a normal map."]
    pub bNormalMap: vlBool,
    #[doc = "!< Normal map generation kernel."]
    pub KernelFilter: VTFKernelFilter,
    #[doc = "!< Method or determining height from input image during normal map creation."]
    pub HeightConversionMethod: VTFHeightConversionMethod,
    #[doc = "!< How to handle output image alpha channel, post normal map creation."]
    pub NormalAlphaResult: VTFNormalAlphaResult,
    #[doc = "!< Minimum normal Z value."]
    pub bNormalMinimumZ: vlByte,
    #[doc = "!< Normal map scale."]
    pub sNormalScale: vlSingle,
    #[doc = "!< Wrap the normal map."]
    pub bNormalWrap: vlBool,
    #[doc = "!< Invert the normal X component."]
    pub bNormalInvertX: vlBool,
    #[doc = "!< Invert the normal Y component."]
    pub bNormalInvertY: vlBool,
    #[doc = "!< Invert the normal Z component."]
    pub bNormalInvertZ: vlBool,
    #[doc = "!< Generate a sphere map for six faced environment maps."]
    pub bSphereMap: vlBool,
}
#[test]
fn bindgen_test_layout_tagSVTFCreateOptions() {
    const UNINIT: ::std::mem::MaybeUninit<tagSVTFCreateOptions> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<tagSVTFCreateOptions>(),
        105usize,
        concat!("Size of: ", stringify!(tagSVTFCreateOptions))
    );
    assert_eq!(
        ::std::mem::align_of::<tagSVTFCreateOptions>(),
        1usize,
        concat!("Alignment of ", stringify!(tagSVTFCreateOptions))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).uiVersion) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tagSVTFCreateOptions),
            "::",
            stringify!(uiVersion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ImageFormat) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tagSVTFCreateOptions),
            "::",
            stringify!(ImageFormat)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).uiFlags) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(tagSVTFCreateOptions),
            "::",
            stringify!(uiFlags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).uiStartFrame) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tagSVTFCreateOptions),
            "::",
            stringify!(uiStartFrame)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sBumpScale) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(tagSVTFCreateOptions),
            "::",
            stringify!(sBumpScale)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sReflectivity) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(tagSVTFCreateOptions),
            "::",
            stringify!(sReflectivity)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bMipmaps) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(tagSVTFCreateOptions),
            "::",
            stringify!(bMipmaps)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MipmapFilter) as usize - ptr as usize },
        37usize,
        concat!(
            "Offset of field: ",
            stringify!(tagSVTFCreateOptions),
            "::",
            stringify!(MipmapFilter)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).MipmapSharpenFilter) as usize - ptr as usize },
        41usize,
        concat!(
            "Offset of field: ",
            stringify!(tagSVTFCreateOptions),
            "::",
            stringify!(MipmapSharpenFilter)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bThumbnail) as usize - ptr as usize },
        45usize,
        concat!(
            "Offset of field: ",
            stringify!(tagSVTFCreateOptions),
            "::",
            stringify!(bThumbnail)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bReflectivity) as usize - ptr as usize },
        46usize,
        concat!(
            "Offset of field: ",
            stringify!(tagSVTFCreateOptions),
            "::",
            stringify!(bReflectivity)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bResize) as usize - ptr as usize },
        47usize,
        concat!(
            "Offset of field: ",
            stringify!(tagSVTFCreateOptions),
            "::",
            stringify!(bResize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ResizeMethod) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(tagSVTFCreateOptions),
            "::",
            stringify!(ResizeMethod)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ResizeFilter) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(tagSVTFCreateOptions),
            "::",
            stringify!(ResizeFilter)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ResizeSharpenFilter) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(tagSVTFCreateOptions),
            "::",
            stringify!(ResizeSharpenFilter)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).uiResizeWidth) as usize - ptr as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(tagSVTFCreateOptions),
            "::",
            stringify!(uiResizeWidth)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).uiResizeHeight) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(tagSVTFCreateOptions),
            "::",
            stringify!(uiResizeHeight)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bResizeClamp) as usize - ptr as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(tagSVTFCreateOptions),
            "::",
            stringify!(bResizeClamp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).uiResizeClampWidth) as usize - ptr as usize },
        69usize,
        concat!(
            "Offset of field: ",
            stringify!(tagSVTFCreateOptions),
            "::",
            stringify!(uiResizeClampWidth)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).uiResizeClampHeight) as usize - ptr as usize },
        73usize,
        concat!(
            "Offset of field: ",
            stringify!(tagSVTFCreateOptions),
            "::",
            stringify!(uiResizeClampHeight)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bGammaCorrection) as usize - ptr as usize },
        77usize,
        concat!(
            "Offset of field: ",
            stringify!(tagSVTFCreateOptions),
            "::",
            stringify!(bGammaCorrection)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sGammaCorrection) as usize - ptr as usize },
        78usize,
        concat!(
            "Offset of field: ",
            stringify!(tagSVTFCreateOptions),
            "::",
            stringify!(sGammaCorrection)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bNormalMap) as usize - ptr as usize },
        82usize,
        concat!(
            "Offset of field: ",
            stringify!(tagSVTFCreateOptions),
            "::",
            stringify!(bNormalMap)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).KernelFilter) as usize - ptr as usize },
        83usize,
        concat!(
            "Offset of field: ",
            stringify!(tagSVTFCreateOptions),
            "::",
            stringify!(KernelFilter)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).HeightConversionMethod) as usize - ptr as usize },
        87usize,
        concat!(
            "Offset of field: ",
            stringify!(tagSVTFCreateOptions),
            "::",
            stringify!(HeightConversionMethod)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).NormalAlphaResult) as usize - ptr as usize },
        91usize,
        concat!(
            "Offset of field: ",
            stringify!(tagSVTFCreateOptions),
            "::",
            stringify!(NormalAlphaResult)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bNormalMinimumZ) as usize - ptr as usize },
        95usize,
        concat!(
            "Offset of field: ",
            stringify!(tagSVTFCreateOptions),
            "::",
            stringify!(bNormalMinimumZ)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sNormalScale) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(tagSVTFCreateOptions),
            "::",
            stringify!(sNormalScale)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bNormalWrap) as usize - ptr as usize },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(tagSVTFCreateOptions),
            "::",
            stringify!(bNormalWrap)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bNormalInvertX) as usize - ptr as usize },
        101usize,
        concat!(
            "Offset of field: ",
            stringify!(tagSVTFCreateOptions),
            "::",
            stringify!(bNormalInvertX)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bNormalInvertY) as usize - ptr as usize },
        102usize,
        concat!(
            "Offset of field: ",
            stringify!(tagSVTFCreateOptions),
            "::",
            stringify!(bNormalInvertY)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bNormalInvertZ) as usize - ptr as usize },
        103usize,
        concat!(
            "Offset of field: ",
            stringify!(tagSVTFCreateOptions),
            "::",
            stringify!(bNormalInvertZ)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bSphereMap) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(tagSVTFCreateOptions),
            "::",
            stringify!(bSphereMap)
        )
    );
}
pub type SVTFCreateOptions = tagSVTFCreateOptions;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VTFLibVTFFile {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VTFLibVMTFile {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VTFLibError {
    _unused: [u8; 0],
}
pub const tagVTFLibOption_VTFLIB_DXT_QUALITY: tagVTFLibOption = 0;
pub const tagVTFLibOption_VTFLIB_LUMINANCE_WEIGHT_R: tagVTFLibOption = 1;
pub const tagVTFLibOption_VTFLIB_LUMINANCE_WEIGHT_G: tagVTFLibOption = 2;
pub const tagVTFLibOption_VTFLIB_LUMINANCE_WEIGHT_B: tagVTFLibOption = 3;
pub const tagVTFLibOption_VTFLIB_BLUESCREEN_MASK_R: tagVTFLibOption = 4;
pub const tagVTFLibOption_VTFLIB_BLUESCREEN_MASK_G: tagVTFLibOption = 5;
pub const tagVTFLibOption_VTFLIB_BLUESCREEN_MASK_B: tagVTFLibOption = 6;
